{
  "header": {
    "title": "Lucas",
    "link-text" : "Projects",
    "link-link" : "/projects",
    "button-text": "Contact me",
    "button-link": "/contact",
    "style": {
      "bg-color":"#ece9e5",
      "padding-left": "50px",
      "padding-right": "50px",
      "gap": "30px",
      "height": "100px",
      "button-color": "#c1b580",
      "color":"#1e2130",
      "borderBTLine": "#1e2130",
      "button-w": "60px"
    }
  },

  "homepage": {
    "splitsection1": {
      "left": {
        "title": "Hey there — welcome to my world!",
        "subtitle": "I'm Lucas, a student at CY Tech, a French engineering school specializing in computer science. Passionate about Cloud, DevOps and Full-Stack development, I'm building the skills today that will help me craft tomorrow’s digital solutions.",
        "button-text": "Let's talk!",
        "button-link": "/contact",
        "style": {
          "bg-color": "#c6c2cd",
          "button-bg-color": "#edb7b3",
          "button-text-color": "#1e2130"
        }
      },
      "right": {
        "card-image-link": "/images/cards/pp1.png",
        "style": {
          "bg-color": "#c6c2cd",
          "button-bg-color": "#edb7b3",
          "button-text-color": "#1e2130"
        }
      } 
    },

    "splitsection2": {
      "right": {
        "title": "My portfolio — my playground",
        "subtitle": "Explore the projects that shape who I am as a developer:",
        "type-of-projects": [
          {
            "id": "1",
            "name": "Full-Stack Magic",
            "description": "Most of my projects dive deep into the Full-Stack universe. I love building clean REST APIs and dynamic frontends. Java and JavaScript are my go-to tools, so you'll find plenty of Spring Boot backends and modern JS frameworks on the frontend. But I’m always curious — chances are you’ll find a tech you love in here!"
          },
          {
            "id": "2",
            "name": "Automation & Deployment",
            "description": "From GitHub Actions workflows to CI/CD pipelines, automation is everywhere in my work. Every recent project is Dockerized and ready to deploy! DevOps isn’t just a buzzword for me — it’s part of how I think and build."
          },
          {
            "id": "3",
            "name": "AI Experiments",
            "description": "I also like to explore AI through small but impactful projects. It may not be my main focus, but I love the incredible results it can bring and how it boosts an application with powerful features."
          }
        ],
        "style": {
          "bg-color": "#ece9e5"
        }
      },
      "left": {
        "image": "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
        "style": {}
      }
    }
  },
  "about": {
    "title": "Need a web app ? Think about me !",
    "profileImage": "/images/cards/pp1.png",
    "style": {
          "bg-color-right": "#c6c2cd",
          "bg-color-left": "#c6c2cd"
        }
  },

  "projects": [
    {
      "id": 1,
      "slug": "auth-api",
      "title": "Auth API",
      "long_title": "Robust Authentication API with JWT, Refresh Tokens, and CI/CD",
      "subtitle": "A secure and production-ready Spring Boot authentication system.",
      "short_description": "A fully featured authentication API using JWT, refresh tokens, blacklist handling, and CI/CD automation.",
      "non_technical_description": "This project is a complete login system that lets users create an account, log in, log out, and refresh their session securely. It's similar to what modern websites use to protect user access and ensure your data stays safe. The API manages user identities while preventing unauthorized access.",
      "technical_description": "Built with Spring Boot and PostgreSQL, the project implements full JWT authentication with access tokens, refresh tokens, and a blacklist mechanism. It follows a clean architecture using Models, DTOs, Repositories, Services, Controllers, and dedicated configuration/security layers. CI/CD pipelines and Docker Compose ensure reproducible environments and automatic deployment. Unit tests validate core features, and complete CRUD flows are implemented for user management.",
      "global_summary": "This authentication API is a solid foundation for secure backend systems. It demonstrates mastery of Spring Security, token-based authentication, Dockerized infrastructure, clean architecture, and CI/CD workflows. Designed in only three days, it reflects efficiency and a strong understanding of production-grade best practices.",
      "github_url": "https://github.com/liro-u/Scorejam",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 2,
      "slug": "scorejam2025",
      "title": "Scorejam 2025 – Roll a Die",
      "long_title": "A Fast-Paced Unity Game Built in 3 Days for Scorejam 2025",
      "subtitle": "Ranked 21/131 – A dice-based roguelike inspired by Binding of Isaac.",
      "short_description": "A Unity game jam project where you play as a cursed dice trying to escape hell, enhanced by AI enemies and bonus rolls.",
      "non_technical_description": "This game puts players in the role of a living dice trying to escape a dangerous maze filled with enemies. After each room, you roll an actual die to win random bonuses, adding unpredictability and excitement. The game mixes action, tension, and a casino-themed atmosphere.",
      "technical_description": "Developed using Unity and C#, the game includes AI pathfinding using NavMesh for enemies that dynamically track the player. The mechanics include custom movement controllers, enemy behaviors, bonus systems, and animation handling. Built by a team of four over three days, with two developers, a graphic artist, and a sound designer.",
      "global_summary": "Roll a Die is a polished and ambitious jam game blending action gameplay with casino aesthetics. It showcases strong teamwork, fast production, and technical abilities in AI movement, gameplay systems, and Unity development.",
      "github_url": "",
      "extra_url": "https://xref.itch.io/roll-a-die",
      "images": ""
    },
    {
      "id": 3,
      "slug": "wrapper-google",
      "title": "Google Wrapper",
      "long_title": "A CI/CD Demonstration Project Mimicking Old Google",
      "subtitle": "A playful search interface with an intentionally broken keyboard mechanic.",
      "short_description": "A fun React project deployed via Docker and CI/CD, recreating old Google but with a twist: the keyboard behaves incorrectly.",
      "non_technical_description": "This website lets you perform searches, but your keyboard works in a strange way. Instead of typing normally, pressing any key cycles through letters, and you must wait before moving to the next one. It’s intentionally frustrating and humorous, like using a glitchy search engine.",
      "technical_description": "Built in React and containerized with Docker, this project focuses on GitHub CI/CD workflows for automated build and deployment. The UI intentionally mimics early Google designs. The custom input system increments letters programmatically instead of reading actual keyboard keys, demonstrating front-end logic manipulation.",
      "global_summary": "This project was created in one day to experiment with CI/CD, Docker setups, and front-end logic, resulting in a quirky and memorable tool blending nostalgia and technical experimentation.",
      "github_url": "https://github.com/LF2Zetrei/project_devops_ci_cd",
      "extra_url": "https://lf2zetrei.github.io/project_devops_ci_cd/",
      "images": ""
    },
    {
      "id": 4,
      "slug": "angular-memory",
      "title": "Angular Memory Game",
      "long_title": "A Celest-Themed Memory Game Built with Angular",
      "subtitle": "Awarded the most beautiful memory game in class.",
      "short_description": "A visually refined Angular memory game centered around a Celest theme.",
      "non_technical_description": "This is a classic card-matching memory game, but reimagined with a beautiful cosmic design. Players flip pairs of cards and try to remember their locations. Its strong visuals make it stand out.",
      "technical_description": "Developed in one day using Angular, the project explores routing, page navigation, and implementing Guards to restrict access to protected areas. It demonstrates clean component structure and basic game state logic.",
      "global_summary": "A well-designed, lightweight Angular project showcasing first steps with routing, guards, and interactive UI design.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 5,
      "slug": "angular-chuck-norris",
      "title": "Chuck Norris Angular App",
      "long_title": "A Joke-Fetching Angular App Using the Chuck Norris Public API",
      "subtitle": "First exploration of Angular HttpClient, Observables, and BehaviorSubjects.",
      "short_description": "A small Angular interface that fetches Chuck Norris jokes with filtering options.",
      "non_technical_description": "This website displays humorous Chuck Norris jokes on demand. You can filter the type of jokes you want to see and refresh them instantly.",
      "technical_description": "The project uses Angular’s HttpClient to fetch data from the ChuckNorris.io API. It implements Observables, BehaviorSubjects, and reactive patterns for state management and dynamic updates.",
      "global_summary": "A concise Angular project centered on API integration and reactive programming basics, built in a single day.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 6,
      "slug": "fastapi-wine-ai",
      "title": "FastAPI Wine Intelligence",
      "long_title": "A Machine Learning API Predicting Wine Quality and Composition",
      "subtitle": "Two ML models + full CRUD + dataset management.",
      "short_description": "A FastAPI service hosting two ML models capable of predicting wine quality or chemical composition.",
      "non_technical_description": "This project lets users explore a dataset of over 1,500 wines and predict characteristics based on chemistry or quality. It’s a simplified version of real tools used in winemaking and data science.",
      "technical_description": "Built with FastAPI and Python, the project includes routers, request authentication, and full CRUD operations to add, delete, or retrieve wines. Two ML models (RandomForestRegressor) were trained: one predicting wine quality from chemical features, and another predicting expected composition based on quality. The dataset contains 1,597 entries and can be re-trained directly through API calls.",
      "global_summary": "This project demonstrates backend routing, ML integration, dataset handling, and automated inference using FastAPI. It blends data engineering and API development into a compact and educational tool.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 7,
      "slug": "data-battle-ia",
      "title": "Data Battle IA Pau",
      "long_title": "An AI-Driven Platform to Generate Law Exam Questions",
      "subtitle": "Semi-finalist – 2-week AI competition.",
      "short_description": "A full RAG system generating law exam questions from 200 complex documents.",
      "non_technical_description": "This project aimed to help law students study more efficiently. The platform analyzed hundreds of documents—including lessons, exams, and corrections—and automatically generated multiple-choice questions to help students train.",
      "technical_description": "The system relied on a RAG architecture: documents were manually cleaned, vectorized sentence-by-sentence, and embedded for semantic search. A Python + FastAPI backend handled question and answer generation, while a Spring Boot API managed user accounts, JWT authentication, and data storage. The front-end was built with SvelteKit, and PostgreSQL stored all generated QCMs. My role included dataset cleaning, embedding generation, authentication, and developing various backend services and controllers.",
      "global_summary": "This project combined NLP, RAG systems, multi-backend architecture, and user-facing educational tools. Reaching the semi-finals validated the robustness and creativity of the approach.",
      "github_url": "https://github.com/LF2Zetrei/data_battle_back",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 8,
      "slug": "discord-chatbot",
      "title": "Discord/Twitch Chat Bot",
      "long_title": "A Dynamic Custom Bot for Twitch Streaming",
      "subtitle": "Improving stream engagement through automated interactions.",
      "short_description": "A custom bot designed to enhance Twitch streams with unique commands and dynamic features.",
      "non_technical_description": "This bot helps make livestreams more fun and interactive. It reacts to the chat, triggers animations or actions, and lets viewers engage with the streamer in creative ways.",
      "technical_description": "Built in JavaScript with Twitch authentication tokens, the bot handles custom commands, real-time event triggers, and dynamic message responses. It is updated continuously and designed to be modular for fast feature additions.",
      "global_summary": "A growing, personal tool designed to support content creation through custom automation and chat interaction.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 9,
      "slug": "corporation-marketplace",
      "title": "Corporation Marketplace",
      "long_title": "A Full Marketplace for a School Association",
      "subtitle": "Complete product management + auth + admin dashboard.",
      "short_description": "A complete marketplace allowing users to browse products and admins to manage stock, prices, and catalog items.",
      "non_technical_description": "This website allowed students to explore and purchase items from the school association. Administrators could easily update products, manage inventory, and add new items through a dedicated interface.",
      "technical_description": "Developed in two months using Kotlin + Spring Boot for the API and Vue.js + Vuetify for the front. It includes authentication, CRUD product management, admin restrictions, and a clean architecture with models, repositories, DTOs, controllers, and config layers. PostgreSQL stores all marketplace data.",
      "global_summary": "A practical marketplace project showcasing full-stack capabilities, admin interfaces, and structured backend architecture.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 10,
      "slug": "portfolio-v1",
      "title": "Portfolio v1",
      "long_title": "My First Full-Stack Portfolio",
      "subtitle": "An early showcase of projects, tutorials, and experiences.",
      "short_description": "A first attempt at building a full-stack personal portfolio with CRUD features.",
      "non_technical_description": "This website collected my early projects and experiences in a simple but functional portfolio. It included sections to present my work and background clearly.",
      "technical_description": "Built with Spring Boot (Kotlin), Vue.js, Vuetify, and PostgreSQL, the portfolio implemented CRUD operations and a clean model + repository + DTO + controller architecture. It served as an introductory full-stack experience.",
      "global_summary": "A foundational project marking the beginning of my full-stack development journey.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 11,
      "slug": "todo-list",
      "title": "Todo List",
      "long_title": "A Full-Stack Learning Project for Kotlin, Spring Boot, and Vue.js",
      "subtitle": "Two weeks of learning new tools from scratch.",
      "short_description": "A complete Todo list application built to learn backend/frontend communication with Spring Boot and Vue.",
      "non_technical_description": "This project is a simple task manager where users can add, edit, and delete their daily tasks. It served as a learning environment for understanding full-stack development.",
      "technical_description": "Created to learn Kotlin, PostgreSQL, Spring Boot, REST API architecture, and Vue.js. It includes CRUD endpoints, state synchronization with the front-end, and GitHub workflow basics.",
      "global_summary": "A small but key project that built the foundation for my future backend and frontend development skills.",
      "github_url": "",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 12,
      "slug": "landes-gonflables",
      "title": "Landes Gonflables",
      "long_title": "Professional Showcase Website for a Local Business",
      "subtitle": "First professional experience — delivered in 3 weeks.",
      "short_description": "A complete static website built for a company, featuring a gallery and product information.",
      "non_technical_description": "This website showcases inflatable structures for rental, presenting images, descriptions, and pricing. It served real customers and helped the company improve its visibility.",
      "technical_description": "Developed using only HTML, CSS, and JavaScript during a professional internship. No web team was available, so everything—from structure to deployment—was handled manually. Hosted on IONOS.",
      "global_summary": "A meaningful first professional project delivered under tight deadlines, proving autonomy and real-world responsibility.",
      "github_url": "",
      "extra_url": "https://www.landes-gonflables.com/app/galerie.html",
      "images": ""
    },
    {
      "id": 13,
      "slug": "portfolio-v2",
      "title": "Portfolio v2",
      "long_title": "A Modular and Extensible Next.js Portfolio",
      "subtitle": "Built in 1 week — designed for long-term evolution.",
      "short_description": "A modern Next.js portfolio with multilingual support, theme context, reusable components, and modular architecture.",
      "non_technical_description": "This portfolio represents who I am today, both technically and personally. It adapts easily to new projects and presents my work in a clean and elegant way.",
      "technical_description": "Built with Next.js using a well-structured architecture: app directory, reusable components, hooks, context, data modules, and public assets. Includes theme and language contexts, custom hooks for data retrieval, and a modular design allowing API replacement without code restructuring.",
      "global_summary": "A personal and flexible portfolio showing my current level of maturity, design sense, and long-term vision for maintainable development.",
      "github_url": "https://github.com/LF2Zetrei/portfolio",
      "extra_url": "",
      "images": ""
    },
    {
      "id": 14,
      "slug": "pokedex-gcp",
      "title": "Pokédex Cloud Platform",
      "long_title": "A CI/CD-Powered Pokédex Deployed on Google Cloud",
      "subtitle": "Microservices, Cloud Run, Cloud SQL, and automated pipelines.",
      "short_description": "A cloud-powered Pokédex with CI/CD pipelines deploying React and Spring Boot services.",
      "non_technical_description": "This project is an online encyclopedia of Pokémon, allowing users to browse creatures, filter them, and discover their characteristics. It is hosted entirely on Google Cloud.",
      "technical_description": "The project uses a microservices architecture: a React front-end and a Spring Boot backend stored in separate repositories. The database uses MySQL on Cloud SQL, while Cloud Build handles CI/CD pipelines that deploy to Cloud Run. Docker and Docker Compose were used for local development. My responsibilities included configuring cloud infrastructure, setting up pipelines, and assisting with the front-end.",
      "global_summary": "A significant cloud computing project exploring DevOps practices, GCP services, microservice architecture, and real-world deployment pipelines.",
      "github_url": "https://github.com/LF2Zetrei/CloudInfrastructure_FernandesLucas_OrsolleEthan_CharrierSimon",
      "extra_url": "https://frontend-506788352665.europe-west1.run.app/",
      "images": ""
    }
  ],
  
  "socials": [
    {
      "name": "GitHub",
      "description": "Find all my projects.",
      "url": "https://github.com/LF2Zetrei?tab=repositories",
      "icon": "/images/socials/github.png",
      "style": {
        "color": "#1e2130",
        "name-color": "#1e2130",
        "icon-color": "#1e2130"
      }
    },
    {
      "name": "LinkedIn",
      "description": "Découvrez mon parcours académique et professionnel.",
      "url": "https://www.linkedin.com/in/username/",
      "icon": "/images/socials/linkedin.png",
      "style": {
        "color": "#1e2130",
        "name-color": "#1e2130",
        "icon-color": "#1e2130"
      }
    },
    {
      "name": "CV",
      "description": "My resume, professional experiences and more about me.",
      "url": "https://twitter.com/username",
      "icon": "/images/socials/cv.png",
      "style": {
        "color": "#1e2130",
        "name-color": "#1e2130",
        "icon-color": "#1e2130"
      }
    }
  ],
  "footer": {
    "style": {
      "gap": "200px",
      "bg-color": "#c6c2cd",
      "padding": "10px"
    }
  }
}
